app/controllers/employees_controller.rb

  def index
    @employees = Employee.all.page(params[:page]).per(10).active.order("#{sort_column} #{sort_direction}")
---
SELECT "employees".* FROM "employees" WHERE "employees"."deleted_at" IS NULL ORDER BY number asc

  def update
    add_params

    if @employee.update(employee_params)
---
UPDATE "employees" SET "updated_at" = ?, "news_posting_auth" = ? WHERE "employees"."id" = ?  [["updated_at", "2022-11-20 02:35:12.090190"], ["news_posting_auth", 1], ["id", 1]]

  def set_employee
    @employee = Employee.find(params["id"])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_form_option
    @departments = Department.all
    @offices = Office.all
---
SELECT "departments".* FROM "departments"
SELECT "offices".* FROM "offices"